import numpy as np
COLORS = np.array([[244, 247, 220], # бежевый
                   [0, 0, 200],     # синий
                   [193, 193, 193], # серый
                   [255, 38, 127],  # розовый
                   [0, 138, 0],     # зеленый
                   [149, 20, 0],    # коричневый
                   [255, 0, 0],     # красный
                   [255, 255, 255], # белый
                   [1, 1, 1],       # черный
                   [255, 98, 159],  # фолетовый, ниже желтый
                   [225, 225, 0]], dtype = float) / 255.0

N_CLUSTERS, N_CLUSTERS_PHOTO, POWER, SIM_POWER = 6, 6, 0.35, 0.3
RANKED_INDICES = [1, 5, 10, 25, 60, 200]
NB_RANKED_PICTURES = 10
